step-by-step/030-populate-database/020-soap/1500-устройства/0700.xml

<?xml version="1.0" ?>
<!-- Модули -> Интернет -> Устройства и ресурсы -> Дерево -> Вставить из библиотеки -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:inetDeviceUpdate xmlns:common="http://common.bitel.ru"
                              xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                              xmlns:xs="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <inetDevice xmlns="" deviceTypeId="3" entityId="0" entitySpecId="2" id="0" ident="10.252.0.22"
                        orderManagerDisabled="false" parentId="7">
                <comment></comment>
                <config></config>
                <host>10.252.0.22:23</host>
                <password>admin</password>
                <secret>secret</secret>
                <username>admin</username>
                <invConfig></invConfig>
                <invDeviceGroupIds>2</invDeviceGroupIds>
                <invDeviceId>5</invDeviceId>
                <invDeviceTypeId>2</invDeviceTypeId>
                <invHost>10.252.0.22:23</invHost>
                <invIdentifier>10.252.0.22</invIdentifier>
            </inetDevice>
            <updateInvDevice xmlns="">false</updateInvDevice>
        </ns5:inetDeviceUpdate>
    </S:Body>
</S:Envelope>
